import React from "react";
import Highlighter from "./Highlight";

const App = () => {
  return (
    <div style={{
        direction:"rtl"
    }}>
      <Highlighter
        caseSensitive={false}
        searchWords={[
          { text: "توییت", onClick: (w)=> console.log(w) },
          { text: "(?:^| )(@\\w+)", onClick: (w)=> console.log(w) },
          { text: "(#.*?)\\s+", onClick: (w)=> console.log(w) },
        ]}
        textToHighlight={"توییت1400/09/04 00:18:21\n" +
        "جالب : جناب #اسماعیل_لله_گانی مدیرعامل بانک رفاه که #محمد_بهمیی رابه مدیرعاملی #پتروشیمی_امیرکبیر منصوب کرد خودش از نجومی‌بگیران سال 94 باحقوق تقریبا 60 میلیون‌تومان دربانک صادرات بود که سال 95 به دستور طیب‌نیا وزیراقتصاد عزل شد .( البته دادگاه بعداگفت😊  این حقوق بالا طبق قانون بوده 😊) https://t.co/ftjvyehzp4\n" +
        "لینک\n" +
        "پاسخ1400/09/11 11:38:49\n" +
        "@shahrabimasoud @dr_abdolmaleki این اقای مدیرعامل خودش توسط #اسماعیل_لله_گانی منصوب شده و بعد از اینکه استعلاماتش منفی شد برای حذف افراد جایگزین دست به جعل فیش‌های حقوقی اون افراد کرد . باید عزل بشه .\n" +
        "\n" +
        "\n" +
        " 240 تومن از کنسلی بلیط مشهد باید #اسنپ تریپ بهم پس میداده هنوز نداده الان یادم افتاد البته خودشون بعد یک ماه پیام دادن که بیا پولتو بدیم\n" +
        "چه وضعشه اقای @snapptripsup \n" +
        "\n" +
        "لینک\n" +
        "کوت1400/09/03 23:43:31\n" +
        "جالب : جناب #اسماعیل_لله_گانی مدیرعامل بانک رفاه که #محمد_بهمیی رابه مدیرعاملی #پتروشیمی_امیرکبیر منصوب کرد خودش از نجومی‌بگیران سال 94 باحقوق تقریبا 60 میلیون‌تومان دjdjdj@jfgdfgh.comربانک صادرات  بود که سال 95 به دستور طیب‌نیا وزیراقت @hhhh صاد عزل شد .( البته دادگاه بعداگفت این حقوق بالا طبق قانون بوده 😊) https://t.co/ftjvyehzp4\n" +
        "\n" +
        "یکی از همکارا باید بره ماموریت و کارای بلیط و هتلشو من باید انجام بدم ، از هر ور میرفتم میرسیدم به علی بابا و اسنپ تریپ و اینا …\n" +
        "در نهایت زنگ زدم مستقیما با هتل هماهنگ کردم ، بلیط هواپیما رو هم از اژانس گرفتم :|\n" +
        "کاش ادم بودین ، خدا لعنتتون کنه که همش دردسرین 🙄\n" +
        "#مهسا_امینی \n" +
        "\n" +
        "لینک\n" +
        "کوت1400/09/11 10:29:07\n" +
        "شاهکار #اسماعیل_لله_گانی مدیر نجومی بگیر سابق که #محمد_بهمیی را به مدیرعاملی #پتروشیمی_امیرکبیر منصوب کرد و ماجرای اون فیش‌های جعلی را بوجود اوردند ! چندین سایت زدن با ترفندهای مختلف که اخبار مرتبط با نجومی گرفتنش جزو صفحات اول گوگل بالا نیاد ! 😀\n" +
        "\n" +
        "\n" +
        "(#.*?)\\s+\n" +
        "\n" +
        "(?:^| )(@\\w+)\n" +
        "\n" +
        "\n" +
        "لینک"}
      />
    </div>
  );
};

export default App;
